local item = {}
 item = {
    ['七彩罗刹'] = {
        colorTable = {
            {960, 538, 0xe6d59b},
            {959, 548, 0xdddec9},
            {972, 544, 0xab9ec0},
            {997, 540, 0x86c4da},
            {1000, 551, 0xe2e2aa},
            {973, 578, 0xe59f75}
        },
        level = 60,
        itemType = '武器',
        topPrice = 190000
    },
    ['乌金鬼头镰'] = {
        colorTable = {
            {1330, 258, 0x8a674c},
            {1319, 271, 0x2c2a3d},
            {1360, 285, 0x5c535b},
            {1384, 306, 0x979bab},
            {1325, 269, 0xd7d9d8}
        },
        level = 60,
        itemType = '武器',
        topPrice = 190000
    },
    ['双魂引'] = {
        colorTable = {{998, 420, 0xc031c2}, {987, 460, 0xe7ebf0}, {980, 476, 0x202631}, {986, 437, 0xbfbb5d}},
        level = 60,
        itemType = '装备',
        topPrice = 190000
    },
    ['夜魔披风'] = {
        colorTable = {
            {614, 422, 0x002c30},
            {593, 472, 0x077282},
            {626, 472, 0x25b3bf},
            {616, 453, 0x087789},
            {598, 458, 0x002f36}
        },
        level = 60,
        itemType = '装备',
        topPrice = 190000
    },
    ['如意宝珠'] = {
        colorTable = {
            {777, 603, 0xe5b352},
            {821, 603, 0xa87b38},
            {776, 615, 0xf8de77},
            {821, 617, 0xf8fce8},
            {782, 630, 0xf1cd40}
        },
        level = 60,
        itemType = '武器',
        topPrice = 190000
    },
    ['孔雀羽'] = {
        colorTable = {
            {1184, 609, 0xd4a0e8},
            {1176, 643, 0x84949b},
            {1146, 630, 0x1dbcc3},
            {1152, 614, 0xf1f8ec},
            {1154, 604, 0x4d84af}
        },
        level = 60,
        itemType = '武器',
        topPrice = 190000
    },
    ['惊涛雪'] = {
        colorTable = {{799, 614, 0xd8ebf5}, {796, 621, 0x1b6aa3}, {824, 647, 0x18267f}, {777, 607, 0xbfdfee}},
        level = 60,
        itemType = '武器',
        topPrice = 190000
    },
    ['攫魂铃'] = {
        colorTable = {
            {605, 641, 0x0d8140},
            {589, 615, 0x9f4cbf},
            {596, 606, 0x390e58},
            {638, 607, 0x482163},
            {615, 593, 0x9db62f}
        },
        level = 60,
        itemType = '装备',
        topPrice = 190000
    },
    ['水晶帽'] = {
        colorTable = {{968, 269, 0x5ad799}, {987, 267, 0xae98cb}, {994, 302, 0x514383}, {1005, 308, 0x9a8438}},
        level = 60,
        itemType = '装备',
        topPrice = 190000
    },
    ['游龙剑'] = {
        colorTable = {{602, 440, 0x19563f}, {619, 463, 0x134a3a}, {632, 471, 0x93bc65}, {637, 479, 0x308755}},
        level = 60,
        itemType = '武器',
        topPrice = 190000
    },
    ['满天星'] = {
        colorTable = {{1330, 430, 0xd1a118}, {1352, 442, 0x946711}, {1338, 433, 0x388bd3}, {1355, 450, 0xd4bc4a}},
        level = 60,
        itemType = '武器',
        topPrice = 190000
    },
    ['狼牙刀'] = {
        colorTable = {
            {966, 543, 0xf4f8f8},
            {975, 542, 0x626b8a},
            {974, 550, 0xf3f8f8},
            {998, 564, 0x3a3550},
            {1006, 585, 0x3e354e},
            {1004, 572, 0x757e9a}
        },
        level = 60,
        itemType = '武器',
        topPrice = 190000
    },
    ['玄铁矛'] = {
        colorTable = {
            {776, 537, 0xe7e9d3},
            {782, 544, 0xa6886e},
            {797, 560, 0x836285},
            {811, 572, 0x8c6041},
            {827, 588, 0x7c5891}
        },
        level = 60,
        itemType = '武器',
        topPrice = 190000
    },
    ['玉女发冠'] = {
        colorTable = {
            {405, 642, 0xb42a20},
            {416, 623, 0xa49b44},
            {434, 608, 0x90781d},
            {462, 614, 0x241e5a},
            {434, 652, 0xaf2410}
        },
        level = 60,
        itemType = '装备',
        topPrice = 190000
    },
    ['玲珑盏'] = {
        colorTable = {
            {632, 256, 0x797d80},
            {598, 249, 0x5e4b38},
            {607, 266, 0xe2edd2},
            {601, 294, 0x9ec4c5},
            {620, 284, 0xf8f8a9},
            {624, 292, 0x999b9c}
        },
        level = 60,
        itemType = '武器',
        topPrice = 190000
    },
    ['神火扇'] = {
        colorTable = {
            {441, 601, 0xd4b876},
            {437, 614, 0xc74001},
            {420, 621, 0xb13408},
            {413, 636, 0xbb3805},
            {401, 638, 0x500000}
        },
        level = 60,
        itemType = '武器',
        topPrice = 190000
    },
    ['腾云杖'] = {
        colorTable = {{1329, 600, 0xf0fcf8}, {1358, 636, 0x48ad99}, {1381, 654, 0xa3f2e2}, {1370, 646, 0x32c095}},
        level = 60,
        itemType = '武器',
        topPrice = 190000
    },
    ['蛇形月'] = {
        colorTable = {
            {796, 426, 0xbab8a2},
            {793, 442, 0xa69e7f},
            {785, 462, 0x8c8c6d},
            {804, 472, 0x3d4539},
            {809, 438, 0x030703}
        },
        level = 60,
        itemType = '武器',
        topPrice = 190000
    },
    ['赤焰双剑'] = {
        colorTable = {{1144, 443, 0xf4f5f6}, {1166, 420, 0xf4f5f5}, {1180, 473, 0x5d2905}},
        level = 60,
        itemType = '武器',
        topPrice = 190000
    },
    ['连珠神弓'] = {
        colorTable = {
            {1346, 271, 0x74b5b3},
            {1369, 249, 0xafd6ee},
            {1326, 295, 0x84def8},
            {1331, 275, 0xce73dc},
            {1352, 257, 0xbe6ad8}
        },
        level = 60,
        itemType = '武器',
        topPrice = 190000
    },
    ['追星踏月'] = {
        colorTable = {
            {436, 600, 0x943b30},
            {447, 596, 0xb15d63},
            {450, 618, 0x2180c4},
            {434, 640, 0x09427a},
            {406, 635, 0xe1e198}
        },
        level = 60,
        itemType = '装备',
        topPrice = 190000
    },
    ['震天锤'] = {
        colorTable = {
            {415, 425, 0x3872a8},
            {419, 435, 0x4a95c6},
            {429, 440, 0x35463a},
            {444, 458, 0x552f67},
            {455, 470, 0x483556},
            {462, 476, 0x38823f}
        },
        level = 60,
        itemType = '武器',
        topPrice = 190000
    },
    ['霓裳羽衣'] = {
        colorTable = {
            {1361, 258, 0xcdddef},
            {1341, 256, 0x25469f},
            {1326, 278, 0xa59ca6},
            {1344, 283, 0xe070b8},
            {1369, 280, 0x733c41},
            {1349, 298, 0xc7897d}
        },
        level = 60,
        itemType = '装备',
        topPrice = 190000
    },
    ['青刚刺'] = {
        colorTable = {
            {779, 600, 0xecb779},
            {790, 614, 0xde8e4d},
            {808, 636, 0x863314},
            {818, 643, 0xcbbdb9},
            {824, 649, 0xd58c4b}
        },
        level = 60,
        itemType = '武器',
        topPrice = 190000
    },
    ['青藤柳叶鞭'] = {
        colorTable = {{787, 468, 0xa1b170}, {812, 450, 0xb3c983}, {814, 459, 0x77885c}, {798, 466, 0xd1e3ab}},
        level = 60,
        itemType = '武器',
        topPrice = 190000
    },
    ['八卦坠'] = {
        colorTable = {
            {1166, 475, 0xe88dd8},
            {1155, 445, 0x898b51},
            {1180, 445, 0xa6a65e},
            {1170, 450, 0x000000},
            {1167, 430, 0x9b9a59}
        },
        level = 60,
        itemType = '装备',
        topPrice = 190000
    },
    ['风月宝链'] = {
        colorTable = {{792, 475, 0x537ccb}, {805, 479, 0xdec33e}, {808, 453, 0xa06bb6}, {796, 453, 0x8f5aa0}},
        level = 60,
        itemType = '装备',
        topPrice = 190000
    },
    --70环
    ['九州履'] = {
        colorTable = {{613, 262, 0xe5c462}, {646, 260, 0x59b6a0}, {598, 285, 0x4db49b}, {640, 293, 0x5f181f}},
        level = 70,
        itemType = '武器',
        topPrice = 100000
    },
    ['乾坤帽'] = {
        colorTable = {
            {403, 245, 0x2e2f41},
            {412, 232, 0xeeefec},
            {427, 230, 0x978ca0},
            {439, 242, 0xdecdb7},
            {449, 243, 0x313043},
            {428, 273, 0x318b78}
        },
        level = 70,
        itemType = '武器',
        topPrice = 100000
    },
    ['兽王腰带'] = {
        colorTable = {
            {432, 304, 0xa34850},
            {412, 258, 0x082244},
            {453, 258, 0x3c4d82},
            {458, 263, 0xa19854},
            {408, 259, 0xd8d477},
            {432, 266, 0xebe4a3}
        },
        level = 70,
        itemType = '武器',
        topPrice = 100000
    },
    ['北斗七星剑'] = {
        colorTable = {{824, 640, 0xaf4ace}, {816, 628, 0x4a413e}, {812, 632, 0x3b2d34}, {785, 607, 0x9a55c5}},
        level = 70,
        itemType = '武器',
        topPrice = 100000
    },
    ['华光刺'] = {
        colorTable = {
            {958, 427, 0xd4b583},
            {970, 446, 0xca8840},
            {985, 455, 0x9d6a3d},
            {991, 462, 0x763f18},
            {1004, 474, 0xcdae6f},
            {977, 456, 0xe0bf7a}
        },
        level = 70,
        itemType = '武器',
        topPrice = 100000
    },
    ['墨玉双剑'] = {
        colorTable = {{1190, 460, 0x6f1413}, {1167, 465, 0xc1948e}, {1149, 448, 0xcda89a}, {1184, 451, 0x9b6468}},
        level = 70,
        itemType = '武器',
        topPrice = 100000
    },
    ['巨灵神锤'] = {
        colorTable = {
            {1157, 434, 0xe3d868},
            {1165, 420, 0xae719e},
            {1172, 447, 0x524e09},
            {1182, 458, 0x292730},
            {1192, 470, 0x5c4d52},
            {1200, 475, 0x82774e}
        },
        level = 70,
        itemType = '武器',
        topPrice = 100000
    },
    ['引魂杖'] = {
        colorTable = {
            {1141, 254, 0x7cbee7},
            {1157, 267, 0x6792be},
            {1172, 282, 0x8098be},
            {1184, 294, 0x7294c3},
            {1198, 308, 0xb8daf1}
        },
        level = 70,
        itemType = '武器',
        topPrice = 100000
    },
    ['水晶棒'] = {
        colorTable = {{1147, 258, 0x2375c5}, {1175, 283, 0xe1f3f0}, {1151, 250, 0x1098e8}},
        level = 70,
        itemType = '武器',
        topPrice = 100000
    },
    ['沧海明珠'] = {
        colorTable = {
            {793, 302, 0x6566ae},
            {792, 275, 0xf593a5},
            {804, 274, 0xf884a0},
            {815, 272, 0xf8bed4},
            {816, 290, 0xf388a9}
        },
        level = 70,
        itemType = '武器',
        topPrice = 100000
    },
    ['流云素裙'] = {
        colorTable = {
            {972, 257, 0xbe6e3d},
            {975, 258, 0xb36037},
            {991, 282, 0xeee8df},
            {973, 288, 0xd26d38},
            {1005, 299, 0xaca1de},
            {1002, 302, 0xf0f7ef}
        },
        level = 70,
        itemType = '武器',
        topPrice = 100000
    },
    ['游鱼戏珠'] = {
        colorTable = {{1000, 259, 0x3469b4}, {976, 275, 0xe0ddd2}, {963, 293, 0x75e9c4}, {959, 311, 0x418877}},
        level = 70,
        itemType = '武器',
        topPrice = 100000
    },
    ['狂魔镰'] = {
        colorTable = {{1155, 269, 0x0c7f18}, {1185, 292, 0x1b1428}, {1138, 264, 0x5b5b6f}},
        level = 70,
        itemType = '武器',
        topPrice = 100000
    },
    ['玉兔盏'] = {
        colorTable = {
            {968, 603, 0xa2884c},
            {1009, 598, 0xb69762},
            {969, 626, 0xe8f9f5},
            {989, 636, 0xb6cacb},
            {996, 647, 0x2aa491},
            {1006, 658, 0x4e3826},
            {1001, 621, 0xb09569}
        },
        level = 70,
        itemType = '武器',
        topPrice = 100000
    },
    ['百窜云'] = {
        colorTable = {
            {781, 267, 0x8c8082},
            {793, 256, 0xb777c3},
            {809, 269, 0x78318e},
            {816, 304, 0x7b3692},
            {831, 310, 0x8859a8},
            {775, 284, 0x9f9849}
        },
        level = 70,
        itemType = '武器',
        topPrice = 100000
    },
    ['碧水青龙'] = {
        colorTable = {
            {598, 260, 0x8d925f},
            {618, 254, 0x7bc0ce},
            {633, 259, 0x589bb6},
            {642, 280, 0x5faec8},
            {604, 288, 0x92b5ad},
            {597, 271, 0xc6c1ad}
        },
        level = 70,
        itemType = '武器',
        topPrice = 100000
    },
    ['缚神绫'] = {
        colorTable = {
            {1145, 250, 0xe4b2a7},
            {1163, 259, 0xa35b62},
            {1196, 271, 0xe8b3a3},
            {1159, 289, 0xe49088},
            {1163, 304, 0xa47473}
        },
        level = 70,
        itemType = '武器',
        topPrice = 100000
    },
    ['醉浮生'] = {
        colorTable = {{1006, 291, 0xaf2113}, {993, 284, 0xce232f}, {956, 254, 0xebe9de}, {966, 261, 0xf3e69c}},
        level = 70,
        itemType = '武器',
        topPrice = 100000
    },
    ['金刚伞'] = {
        colorTable = {
            {643, 482, 0x5a4138},
            {628, 462, 0xdcc976},
            {632, 421, 0xbe8d43},
            {585, 462, 0x9f7250},
            {616, 446, 0xefeae8}
        },
        level = 70,
        itemType = '武器',
        topPrice = 100000
    },
    ['金蛇信'] = {
        colorTable = {{402, 422, 0x3980da}, {417, 440, 0x357bd7}, {449, 469, 0x90603a}, {460, 479, 0x85663b}},
        level = 70,
        itemType = '武器',
        topPrice = 100000
    },
    ['阴风扇'] = {
        colorTable = {
            {773, 295, 0x843480},
            {777, 271, 0x831f65},
            {796, 258, 0x812f7b},
            {820, 259, 0x691e60},
            {804, 281, 0x481e3e},
            {807, 293, 0x5a1d44}
        },
        level = 70,
        itemType = '武器',
        topPrice = 100000
    },
    ['雷鸣嗜血鞭'] = {
        colorTable = {{1334, 478, 0xa59373}, {1356, 464, 0xbe8086}, {1374, 430, 0x675944}, {1348, 470, 0x8d7a4c}},
        level = 70,
        itemType = '武器',
        topPrice = 100000
    },
    ['鬼牙攫魂'] = {
        colorTable = {
            {1160, 284, 0x0d4636},
            {1172, 270, 0xa23f46},
            {1182, 290, 0xa1373c},
            {1173, 282, 0x083a37},
            {1161, 278, 0x79e2b9}
        },
        level = 70,
        itemType = '武器',
        topPrice = 100000
    },
    ['魔女发冠'] = {
        colorTable = {{780, 442, 0xaa53aa}, {804, 421, 0xe5474b}, {820, 422, 0xee4f5a}, {808, 467, 0x033b2d}},
        level = 70,
        itemType = '武器',
        topPrice = 100000
    },
    ['龙骨甲'] = {
        colorTable = {
            {411, 253, 0x6a6a61},
            {427, 250, 0x201c20},
            {443, 255, 0x6d6964},
            {408, 302, 0x4e332f},
            {430, 274, 0xbdb5a3},
            {453, 308, 0x81565b}
        },
        level = 70,
        itemType = '武器',
        topPrice = 100000
    },
    ['龙鳞宝刀'] = {
        colorTable = {
            {1369, 292, 0x262838},
            {1338, 262, 0x6a6f8d},
            {1328, 255, 0xd0d8e0},
            {1376, 307, 0x4e6176},
            {1349, 275, 0x4b5269}
        },
        level = 70,
        itemType = '武器',
        topPrice = 100000
    },
    ['子母双月'] = {
        colorTable = {
            {793, 256, 0xcbc3cf},
            {794, 272, 0xbcb2c5},
            {799, 287, 0x504857},
            {798, 300, 0x72667d},
            {817, 296, 0xc9c2ce}
        },
        level = 70,
        itemType = '武器',
        topPrice = 100000
    },
    --80环
    ['七宝天衣'] = {
        colorTable = {
            {781, 598, 0x477b44},
            {822, 597, 0x082009},
            {786, 643, 0x3a6437},
            {812, 634, 0x122d18},
            {794, 611, 0x0948b8}
        },
        level = 80,
        itemType = '装备',
        topPrice = 100000
    },
    ['七彩花环'] = {
        colorTable = {{985, 422, 0x461f00}, {987, 460, 0x401c00}, {976, 441, 0xce4553}, {996, 447, 0x18a040}},
        level = 80,
        itemType = '装备',
        topPrice = 100000
    },
    ['万里卷云'] = {
        colorTable = {
            {1331, 248, 0x507fe2},
            {1369, 224, 0x6f84c3},
            {1358, 242, 0x627cce},
            {1365, 252, 0x3c56c4},
            {1370, 262, 0x5682ce},
            {1380, 271, 0x3d3aa1}
        },
        level = 80,
        itemType = '装备',
        topPrice = 100000
    },
    ['万里追云履'] = {
        colorTable = {
            {1183, 262, 0x071b28},
            {1167, 262, 0x205613},
            {1169, 259, 0x4f8d48},
            {1157, 294, 0x075966},
            {1173, 294, 0x10d2cf},
            {1186, 292, 0x09878d}
        },
        level = 80,
        itemType = '装备',
        topPrice = 100000
    },
    ['丈八点钢矛'] = {
        colorTable = {{972, 439, 0x582818}, {1014, 484, 0x765240}, {957, 422, 0xd0d3d5}},
        level = 80,
        itemType = '武器',
        topPrice = 100000
    },
    ['九天仙绫'] = {
        colorTable = {
            {403, 600, 0xe6dbb0},
            {441, 596, 0xeddfa7},
            {456, 611, 0xebdda6},
            {445, 622, 0xe3d4a3},
            {421, 637, 0xe8cf8d},
            {425, 655, 0xb8a88f}
        },
        level = 80,
        itemType = '武器',
        topPrice = 100000
    },
    ['八卦缎带'] = {
        colorTable = {
            {1141, 621, 0xbabc67},
            {1149, 607, 0x261f1e},
            {1166, 627, 0xe8ece8},
            {1174, 628, 0x000000},
            {1189, 630, 0x484127},
            {1197, 628, 0x463a30}
        },
        level = 80,
        itemType = '装备',
        topPrice = 100000
    },
    ['冰心盏'] = {
        colorTable = {
            {822, 596, 0x389bca},
            {782, 592, 0x279bcf},
            {785, 603, 0xce9139},
            {779, 633, 0x289ec7},
            {791, 623, 0x1985cc}
        },
        level = 80,
        itemType = '武器',
        topPrice = 100000
    },
    ['圣王坠'] = {
        colorTable = {
            {975, 444, 0x86661a},
            {986, 444, 0x7249a3},
            {995, 444, 0x846319},
            {988, 469, 0x4432b0},
            {983, 476, 0xc773e0}
        },
        level = 80,
        itemType = '装备',
        topPrice = 100000
    },
    ['天崩地裂'] = {
        colorTable = {{620, 452, 0x6091a1}, {628, 486, 0x70bec0}, {600, 443, 0x2e0360}, {615, 428, 0x2f0364}},
        level = 80,
        itemType = '武器',
        topPrice = 100000
    },
    ['恶龙之齿'] = {
        colorTable = {{587, 608, 0xc0d4d1}, {596, 598, 0x444b49}, {645, 653, 0x453853}, {604, 599, 0xdde2e5}},
        level = 80,
        itemType = '武器',
        topPrice = 100000
    },
    ['斜月狼牙'] = {
        colorTable = {
            {786, 278, 0x91a8b2},
            {812, 249, 0xc9cdd8},
            {790, 260, 0x8399a0},
            {811, 269, 0x1f2124},
            {803, 300, 0x57636c},
            {784, 302, 0x8ba3ab}
        },
        level = 80,
        itemType = '武器',
        topPrice = 100000
    },
    ['无量玉璧'] = {
        colorTable = {{988, 451, 0x333861}, {1006, 450, 0x1e1448}, {966, 446, 0x5efbd8}, {986, 470, 0x297c29}},
        level = 80,
        itemType = '武器',
        topPrice = 100000
    },
    ['日月光华'] = {
        colorTable = {
            {1340, 427, 0x775daa},
            {1346, 435, 0xcf8f44},
            {1357, 454, 0x8d94ba},
            {1368, 470, 0x5c7579},
            {1377, 479, 0x647d75},
            {1337, 431, 0xf0f1f0}
        },
        level = 80,
        itemType = '武器',
        topPrice = 100000
    },
    ['梅花双剑'] = {
        colorTable = {{795, 626, 0x602708}, {827, 651, 0x855c42}, {812, 608, 0xe5dac1}},
        level = 80,
        itemType = '武器',
        topPrice = 100000
    },
    ['死亡斗篷'] = {
        colorTable = {
            {1352, 592, 0x400400},
            {1373, 599, 0xa03527},
            {1353, 626, 0xa83125},
            {1366, 627, 0x943428},
            {1349, 640, 0xd88479},
            {1364, 643, 0xd48274}
        },
        level = 80,
        itemType = '装备',
        topPrice = 100000
    },
    ['沉戟天戉'] = {
        colorTable = {{960, 603, 0x596055}, {982, 623, 0x3d3428}, {1005, 645, 0x303d43}, {969, 610, 0x585a54}},
        level = 80,
        itemType = '武器',
        topPrice = 100000
    },
    ['混元金钩'] = {
        colorTable = {{602, 468, 0x7097b7}, {626, 441, 0x6562a8}, {633, 423, 0x34586b}},
        level = 80,
        itemType = '武器',
        topPrice = 100000
    },
    ['灵犀望月'] = {
        colorTable = {
            {822, 255, 0xbfb561},
            {799, 250, 0xf3f6d2},
            {790, 261, 0x678e8a},
            {769, 279, 0xeceeb7},
            {771, 303, 0xdad972},
            {801, 254, 0xddcc44}
        },
        level = 80,
        itemType = '武器',
        topPrice = 100000
    },
    ['疾风之铃'] = {
        colorTable = {
            {615, 248, 0x6a84cc},
            {617, 278, 0x7a7164},
            {620, 288, 0x826283},
            {618, 300, 0x6595ed},
            {629, 271, 0xab9668},
            {627, 296, 0x637cd3}
        },
        level = 80,
        itemType = '装备',
        topPrice = 100000
    },
    ['碧玺杖'] = {
        colorTable = {
            {401, 544, 0x69a185},
            {408, 544, 0xc9f07c},
            {416, 534, 0x9aefad},
            {414, 550, 0x1e5a58},
            {434, 568, 0x2b6961},
            {462, 596, 0x1f4949}
        },
        level = 80,
        itemType = '武器',
        topPrice = 100000
    },
    ['落梅伞'] = {
        colorTable = {
            {602, 255, 0xd3b283},
            {609, 262, 0xf8c063},
            {625, 262, 0xf2573f},
            {608, 285, 0xf0d7a0},
            {590, 281, 0xd9b287},
            {641, 306, 0x62472b}
        },
        level = 80,
        itemType = '武器',
        topPrice = 100000
    },
    ['风云雷电'] = {
        colorTable = {
            {592, 640, 0x902400},
            {590, 627, 0xce4000},
            {622, 597, 0xf06400},
            {639, 599, 0xd34604},
            {607, 614, 0xea6c0b}
        },
        level = 80,
        itemType = '武器',
        topPrice = 100000
    },
    ['黑炎魔刀'] = {
        colorTable = {{412, 604, 0x49576a}, {400, 601, 0xe4e9e7}, {445, 642, 0x56740e}, {460, 650, 0x849c28}},
        level = 80,
        itemType = '装备',
        topPrice = 100000
    },
    ['黑魔冠'] = {
        colorTable = {{447, 276, 0x019139}, {426, 288, 0x431848}, {434, 300, 0x360e36}, {434, 286, 0x009034}},
        level = 80,
        itemType = '武器',
        topPrice = 100000
    },
    ['龙鳞刺'] = {
        colorTable = {{770, 254, 0xe5dba6}, {796, 283, 0xb05000}, {814, 291, 0x947108}, {835, 309, 0x365829}},
        level = 80,
        itemType = '武器',
        topPrice = 100000
    },
    ['碧玉剑'] = {
        colorTable = {{587, 597, 0x98edc2}, {629, 636, 0x884010}, {633, 634, 0x18cd53}, {626, 639, 0x15ce53}},
        level = 70,
        itemType = '武器',
        topPrice = 100000
    },
    ['仙人掌'] = {
        colorTable = {
            {977, 431, 0x154200},
            {979, 444, 0x1e4700},
            {990, 451, 0x434808},
            {990, 436, 0x254601},
            {975, 464, 0x64492a},
            {985, 473, 0x100e08}
        },
        level = 1,
        itemType = '家具',
        topPrice = 35000
    },
    ['八卦镇邪榻'] = {
        colorTable = {
            {422, 268, 0xbd6038},
            {414, 274, 0xd86838},
            {424, 279, 0xb0e5a7},
            {432, 282, 0xb9be80},
            {438, 283, 0xb5de94},
            {423, 293, 0xd67b57}
        },
        level = 1,
        itemType = '家具',
        topPrice = 35000
    },
    ['兽皮地毯'] = {
        colorTable = {
            {1152, 245, 0x74753c},
            {1168, 248, 0xe09960},
            {1182, 250, 0x2f361b},
            {1191, 250, 0xcb9940},
            {1176, 258, 0xd1b462}
        },
        level = 1,
        itemType = '家具',
        topPrice = 35000
    },
    ['印花屏风'] = {
        colorTable = {
            {972, 260, 0x585556},
            {988, 267, 0x4c3f27},
            {971, 270, 0x3d4125},
            {984, 279, 0x394421},
            {993, 280, 0x404428},
            {992, 306, 0x996f32}
        },
        level = 1,
        itemType = '家具',
        topPrice = 35000
    },
    ['双鱼吉庆柜'] = {
        colorTable = {
            {1162, 269, 0xd06e38},
            {1170, 259, 0xd87940},
            {1179, 264, 0xda753d},
            {1162, 285, 0x793d20},
            {1172, 286, 0x523010}
        },
        level = 1,
        itemType = '家具',
        topPrice = 35000
    },
    ['君子兰'] = {
        colorTable = {
            {431, 269, 0x000600},
            {420, 284, 0x4d4c59},
            {432, 286, 0x594015},
            {443, 294, 0x2b1f0a},
            {438, 258, 0x31a120}
        },
        level = 1,
        itemType = '家具',
        topPrice = 35000
    },
    ['夕阳山水图'] = {
        colorTable = {
            {787, 416, 0x6b4229},
            {797, 414, 0x38463a},
            {814, 406, 0xa28248},
            {819, 402, 0x65442a},
            {805, 420, 0x462b1c}
        },
        level = 1,
        itemType = '家具',
        topPrice = 35000
    },
    ['天山云雪'] = {
        colorTable = {
            {609, 606, 0xf0a678},
            {623, 596, 0xe1b490},
            {610, 627, 0x703b1c},
            {621, 628, 0x5a321a},
            {608, 645, 0x5a2f14},
            {627, 645, 0x482916}
        },
        level = 1,
        itemType = '家具',
        topPrice = 35000
    },
    ['嵌玉虎纹桌'] = {
        colorTable = {
            {969, 265, 0xab6038},
            {989, 267, 0x86e050},
            {968, 281, 0xaa9141},
            {1000, 282, 0x6e4428},
            {992, 267, 0xbeed53}
        },
        level = 1,
        itemType = '家具',
        topPrice = 35000
    },
    ['彩绘立柜'] = {
        colorTable = {
            {1151, 434, 0x663a2b},
            {1167, 430, 0xcc6e54},
            {1187, 436, 0x83524b},
            {1165, 438, 0xd47058},
            {1159, 450, 0x024626},
            {1179, 452, 0x034523}
        },
        level = 1,
        itemType = '家具',
        topPrice = 35000
    },
    ['彩绘花瓶'] = {
        colorTable = {
            {800, 607, 0x3c8aa8},
            {796, 618, 0x518aa6},
            {804, 618, 0x386e84},
            {801, 631, 0x4e8faa},
            {793, 631, 0xa15935},
            {808, 632, 0x78452d}
        },
        level = 1,
        itemType = '家具',
        topPrice = 35000
    },
    ['文竹'] = {
        colorTable = {
            {609, 598, 0x687445},
            {619, 595, 0x546733},
            {609, 622, 0x392d0a},
            {610, 643, 0x393321},
            {622, 643, 0x312e17},
            {617, 615, 0x385266}
        },
        level = 1,
        itemType = '家具',
        topPrice = 35000
    },
    ['月牙凳'] = {
        colorTable = {
            {604, 579, 0x4e848a},
            {607, 593, 0x6d4f42},
            {607, 602, 0x6c5049},
            {623, 588, 0x009875},
            {628, 602, 0x815041}
        },
        level = 1,
        itemType = '家具',
        topPrice = 35000
    },
    ['桦木圆桌'] = {
        colorTable = {
            {1149, 263, 0xe49530},
            {1180, 260, 0x487268},
            {1188, 264, 0xefab3f},
            {1167, 290, 0xe89829},
            {1141, 279, 0x1d1804},
            {1197, 279, 0x474543}
        },
        level = 1,
        itemType = '家具',
        topPrice = 35000
    },
    ['桦木地板'] = {
        colorTable = {
            {968, 614, 0xa9a163},
            {985, 606, 0x978b50},
            {1011, 622, 0xa0954c},
            {1009, 630, 0x34381b},
            {985, 643, 0x323218},
            {967, 634, 0x303819}
        },
        level = 1,
        itemType = '家具',
        topPrice = 35000
    },
    ['桦木立柜'] = {
        colorTable = {
            {603, 537, 0xe1a958},
            {615, 534, 0xeeb860},
            {620, 548, 0x302815},
            {605, 566, 0x1c3d54},
            {631, 578, 0x150f02},
            {633, 539, 0xcea15d}
        },
        level = 1,
        itemType = '家具',
        topPrice = 35000
    },
    ['桦木靠背椅'] = {
        colorTable = {
            {789, 439, 0x8f5032},
            {804, 428, 0x945333},
            {818, 454, 0x945231},
            {789, 463, 0x5a2d19},
            {812, 461, 0x412410}
        },
        level = 1,
        itemType = '家具',
        topPrice = 35000
    },
    ['榛木床'] = {
        colorTable = {
            {775, 444, 0xc6ac58},
            {800, 439, 0x8ddf80},
            {815, 451, 0x3d6357},
            {787, 462, 0xd98d30},
            {797, 451, 0xebeb83}
        },
        level = 1,
        itemType = '家具',
        topPrice = 35000
    },
    ['水仙'] = {
        colorTable = {
            {616, 594, 0xe0f2a0},
            {612, 614, 0x1d1d0b},
            {618, 619, 0x48594a},
            {609, 634, 0x282000},
            {627, 649, 0x856948}
        },
        level = 1,
        itemType = '家具',
        topPrice = 35000
    },
    ['漆花地板'] = {
        colorTable = {
            {953, 388, 0x293726},
            {982, 400, 0x7d7f5f},
            {1016, 388, 0x393d35},
            {983, 375, 0x7a7d60},
            {979, 391, 0x777b58},
            {999, 392, 0x797e64}
        },
        level = 1,
        itemType = '家具',
        topPrice = 35000
    },
    ['漆花竹凳'] = {
        colorTable = {
            {787, 381, 0x4b3f37},
            {810, 381, 0xb87927},
            {799, 375, 0xf5a938},
            {786, 392, 0x261f07},
            {803, 396, 0x282209},
            {815, 394, 0x363128}
        },
        level = 1,
        itemType = '家具',
        topPrice = 35000
    },
    ['狮子图屏风'] = {
        colorTable = {
            {1334, 259, 0x876461},
            {1359, 273, 0x663718},
            {1369, 275, 0x78492d},
            {1344, 280, 0x56351f},
            {1357, 283, 0x603418},
            {1369, 292, 0x663b1c}
        },
        level = 1,
        itemType = '家具',
        topPrice = 35000
    },
    ['猛虎坐山图'] = {
        colorTable = {
            {1347, 614, 0x755936},
            {1361, 606, 0x5a3a2b},
            {1353, 620, 0x586a8b},
            {1353, 634, 0x697f99},
            {1359, 639, 0x837a47},
            {1368, 636, 0x5f4235}
        },
        level = 1,
        itemType = '家具',
        topPrice = 35000
    },
    ['玉瓷画瓶'] = {
        colorTable = {
            {1163, 402, 0x484f4b},
            {1170, 407, 0x0d130e},
            {1175, 403, 0x45485f},
            {1167, 419, 0x9ec1e4},
            {1175, 419, 0x61758b},
            {1164, 432, 0x48380f}
        },
        level = 1,
        itemType = '家具',
        topPrice = 30000
    },
    ['银烛台'] = {
        colorTable = {
            {1168, 359, 0xb18960},
            {1170, 377, 0x8599ab},
            {1169, 395, 0x2f291b},
            {1165, 410, 0x382708},
            {1171, 409, 0x543b10}
        },
        level = 1,
        itemType = '家具',
        topPrice = 35000
    },
    ['蝴蝶兰'] = {
        colorTable = {
            {1348, 435, 0x9481aa},
            {1357, 438, 0x1c3010},
            {1346, 451, 0x21465c},
            {1356, 452, 0x2d2009},
            {1355, 472, 0x251c02},
            {1349, 466, 0x162532}
        },
        level = 1,
        itemType = '家具',
        topPrice = 35000
    },
    ['白鹤展翅帘'] = {
        colorTable = {
            {1344, 440, 0xd4606f},
            {1361, 447, 0xee6073},
            {1364, 457, 0xd44c62},
            {1340, 455, 0xf66881},
            {1351, 458, 0xce7978},
            {1349, 470, 0x5c454c}
        },
        level = 1,
        itemType = '家具',
        topPrice = 35000
    },
    ['神仙帐'] = {
        colorTable = {
            {597, 264, 0x749db1},
            {624, 268, 0xa8d9e8},
            {599, 286, 0x94bdd4},
            {617, 288, 0x88ae57},
            {632, 291, 0x688aa7},
            {610, 297, 0x814f29}
        },
        level = 1,
        itemType = '家具',
        topPrice = 35000
    },
    ['红木八仙桌'] = {
        colorTable = {
            {967, 440, 0xca6830},
            {984, 431, 0xcb6834},
            {1004, 442, 0x7c4426},
            {984, 442, 0xc76030},
            {977, 463, 0xa1532e}
        },
        level = 1,
        itemType = '家具',
        topPrice = 35000
    },
    ['花鸟图屏风'] = {
        colorTable = {
            {1340, 430, 0x904c29},
            {1338, 437, 0x5b7658},
            {1337, 441, 0xcce9dc},
            {1363, 468, 0x8b4e30},
            {1368, 454, 0x97bfb3},
            {1375, 459, 0x9a6042}
        },
        level = 1,
        itemType = '家具',
        topPrice = 35000
    },
    ['长信宫灯'] = {
        colorTable = {
            {806, 603, 0xd79c03},
            {794, 602, 0x5b3d00},
            {791, 617, 0x3f2c00},
            {801, 635, 0x341e00},
            {815, 636, 0x6f4b00}
        },
        level = 1,
        itemType = '家具',
        topPrice = 35000
    },
    ['雕花马桶'] = {
        colorTable = {
            {1162, 609, 0x763916},
            {1175, 611, 0x5e3115},
            {1160, 620, 0x7d4323},
            {1174, 618, 0x743e21},
            {1168, 625, 0x773f22},
            {1169, 630, 0x140c04}
        },
        level = 1,
        itemType = '家具',
        topPrice = 35000
    },
    ['麻布地毯'] = {
        colorTable = {
            {1143, 276, 0xc5c283},
            {1161, 274, 0xebea9d},
            {1177, 286, 0xb8c590},
            {1188, 283, 0x4c8679},
            {1188, 281, 0xc9d498},
            {1157, 279, 0xa9ddcb}
        },
        level = 1,
        itemType = '家具',
        topPrice = 35000
    },
    ['黑麻垂曼帘'] = {
        colorTable = {
            {604, 271, 0xa0ced1},
            {617, 271, 0x797d83},
            {631, 263, 0x9c6459},
            {619, 287, 0x8cbcc8},
            {626, 295, 0x925155},
            {601, 294, 0xb4b576}
        },
        level = 1,
        itemType = '家具',
        topPrice = 35000
    },
    ['龟鹤延年灯'] = {
        colorTable = {
            {607, 595, 0xac6513},
            {616, 626, 0xd59b00},
            {625, 625, 0x977d5b},
            {617, 634, 0x432a00},
            {622, 633, 0x583500},
            {617, 645, 0x625147},
            {617, 654, 0x6b4900}
        },
        level = 1,
        itemType = '家具',
        topPrice = 35000
    },
    ['蓝绸绣花帘'] = {
        colorTable = {
            {416, 278, 0x573917},
            {456, 259, 0x716437},
            {421, 288, 0x8bb2d4},
            {437, 287, 0x389585},
            {453, 282, 0x39887c},
            {437, 297, 0x828eab}
        },
        level = 2,
        itemType = '家具',
        topPrice = 35000
    },
    ['踏春图'] = {
        colorTable = {
            {988, 597, 0x9a7038},
            {981, 619, 0xcbd9ab},
            {989, 631, 0xbec26d},
            {985, 650, 0xb1be80},
            {979, 654, 0xb78441}
        },
        level = 1,
        itemType = '家具',
        topPrice = 35000
    },
    ['草编地毯'] = {
        colorTable = {
            {1325, 627, 0x5293be},
            {1347, 622, 0xb7af56},
            {1373, 622, 0x69a59a},
            {1354, 630, 0xd8d069},
            {1348, 639, 0x459fb5}
        },
        level = 1,
        itemType = '家具',
        topPrice = 35000
    },
    --花乐器
    ['唢呐'] = {
        colorTable = {
            {1145, 438, 0xb06908},
            {1170, 437, 0xa46906},
            {1195, 429, 0xbfa33f},
            {1202, 427, 0x906f1f},
            {1162, 464, 0xf0cc18}
        },
        level = 1,
        itemType = '花乐',
        topPrice = 180000
    },
    ['康乃馨'] = {
        colorTable = {
            {417, 254, 0xaff1e7},
            {442, 262, 0x27c5bc},
            {454, 266, 0x5fc3c5},
            {421, 279, 0x47c4c0},
            {446, 275, 0x0c7173},
            {434, 294, 0x164240}
        },
        level = 1,
        itemType = '花乐',
        topPrice = 50000
    },
    ['木鱼'] = {
        colorTable = {
            {1171, 259, 0xa78d6d},
            {1192, 266, 0x301c0e},
            {1155, 276, 0x7a5d4d},
            {1170, 292, 0x674634},
            {1177, 297, 0x825d45},
            {1192, 270, 0x311f10}
        },
        level = 1,
        itemType = '花乐',
        topPrice = 50000
    },
    ['牡丹'] = {
        colorTable = {
            {400, 261, 0x8f8faf},
            {423, 262, 0xe3e8e2},
            {455, 263, 0x195b74},
            {409, 302, 0x207753},
            {458, 278, 0x165973}
        },
        level = 1,
        itemType = '花乐',
        topPrice = 30000
    },
    ['百合'] = {
        colorTable = {
            {793, 252, 0xf0f1f0},
            {804, 271, 0x949b46},
            {777, 274, 0xf0f8f0},
            {782, 291, 0x1f9534},
            {795, 297, 0xebccdb},
            {808, 267, 0x99a143}
        },
        level = 1,
        itemType = '花乐',
        topPrice = 50000
    },
    ['竖琴'] = {
        colorTable = {
            {400, 625, 0x696c22},
            {415, 628, 0x8c8944},
            {428, 616, 0x756856},
            {442, 611, 0x614849},
            {455, 605, 0x6f5d5c}
        },
        level = 1,
        itemType = '花乐',
        topPrice = 150000
    },
    ['笛子'] = {
        colorTable = {{400, 283, 0x36272e}, {437, 271, 0x967b3c}, {461, 261, 0x8d7e49}, {460, 283, 0xc84448}},
        level = 1,
        itemType = '花乐',
        topPrice = 150000
    },
    ['红玫瑰'] = {
        colorTable = {
            {967, 597, 0xb04848},
            {987, 596, 0xac3c42},
            {972, 619, 0xb84d53},
            {987, 619, 0xb23f44},
            {976, 611, 0xa1c068},
            {995, 653, 0x513f43}
        },
        level = 1,
        itemType = '花乐',
        topPrice = 400000
    },
    ['编钟'] = {
        colorTable = {
            {410, 434, 0xcf8c3e},
            {442, 426, 0xcd863d},
            {456, 437, 0x845b17},
            {428, 454, 0xb0a56b},
            {413, 475, 0x989321},
            {461, 468, 0x701c00}
        },
        level = 1,
        itemType = '花乐',
        topPrice = 190000
    },
    ['琵琶'] = {
        colorTable = {
            {451, 251, 0xd0ab6d},
            {433, 266, 0xb39663},
            {410, 286, 0xcda055},
            {420, 293, 0xd2ba83},
            {429, 299, 0xce9f56},
            {451, 264, 0xc4a572}
        },
        level = 1,
        itemType = '花乐',
        topPrice = 110000
    },
    --三级药
    ['九转还魂丹'] = {
        colorTable = {
            {981, 251, 0x512e3b},
            {980, 262, 0x568ec1},
            {971, 286, 0x8ccce8},
            {984, 285, 0x4b89c0},
            {991, 307, 0x21943c}
        },
        level = 3,
        itemType = '三级药',
        topPrice = 20000
    },
    ['五龙丹'] = {
        colorTable = {
            {430, 607, 0xe1942d},
            {406, 617, 0xcff2f0},
            {425, 634, 0x22a736},
            {437, 628, 0xecd426},
            {449, 615, 0xb741ba}
        },
        level = 3,
        itemType = '三级药',
        topPrice = 20000
    },
    ['佛光舍利子'] = {
        colorTable = {
            {612, 609, 0xbad84e},
            {628, 600, 0xebf6be},
            {606, 630, 0xb17634},
            {623, 626, 0x854822},
            {626, 640, 0x582010}
        },
        level = 3,
        itemType = '三级药',
        topPrice = 20000
    },
    ['十香返生丸'] = {
        colorTable = {
            {1347, 596, 0xe8d748},
            {1367, 599, 0xa4922b},
            {1366, 621, 0x706a6a},
            {1332, 634, 0x814349},
            {1354, 642, 0x7b444a},
            {1371, 635, 0x2a2f72}
        },
        level = 3,
        itemType = '三级药',
        topPrice = 20000
    },
    ['千年保心丹'] = {
        colorTable = {
            {592, 283, 0xf09fbe},
            {612, 262, 0xf0f8f0},
            {635, 280, 0xc6f3f0},
            {637, 260, 0x802c40},
            {615, 292, 0x982840},
            {617, 275, 0x95dae2}
        },
        level = 3,
        itemType = '三级药',
        topPrice = 20000
    },
    ['定神香'] = {
        colorTable = {
            {1149, 427, 0x1f4857},
            {1169, 432, 0xde352c},
            {1187, 428, 0x3da9c9},
            {1148, 456, 0x82ddf0},
            {1186, 452, 0xd92d23}
        },
        level = 3,
        itemType = '三级药',
        topPrice = 20000
    },
    ['小还丹'] = {
        colorTable = {
            {975, 605, 0x77253b},
            {990, 603, 0xb24db1},
            {1007, 609, 0x652132},
            {967, 625, 0xe080a1},
            {1001, 631, 0x7e2b81}
        },
        level = 3,
        itemType = '三级药',
        topPrice = 20000
    },
    ['红雪散'] = {
        colorTable = {
            {817, 251, 0x2a48a2},
            {807, 290, 0x392975},
            {804, 298, 0xd35499},
            {781, 295, 0xf07dc6},
            {783, 280, 0xf091df}
        },
        level = 3,
        itemType = '三级药',
        topPrice = 20000
    },
    ['蛇蝎美人'] = {
        colorTable = {
            {1164, 255, 0xd1743a},
            {1158, 248, 0x5c6480},
            {1173, 264, 0x4e6181},
            {1172, 307, 0xb55120},
            {1188, 286, 0x955333}
        },
        level = 3,
        itemType = '三级药',
        topPrice = 20000
    },
    ['金香玉'] = {
        colorTable = {
            {429, 255, 0xe27858},
            {435, 259, 0xb74043},
            {458, 268, 0xb56dc6},
            {434, 269, 0x723175},
            {420, 294, 0xd72a30},
            {439, 295, 0x730d24}
        },
        level = 3,
        itemType = '三级药',
        topPrice = 20000
    },
    ['风水混元丹'] = {
        colorTable = {
            {825, 266, 0xbc90ad},
            {811, 266, 0x6c221a},
            {783, 284, 0xeccae4},
            {801, 292, 0xb48ea9},
            {805, 270, 0xd87438},
            {798, 258, 0x320d0c}
        },
        level = 3,
        itemType = '三级药',
        topPrice = 20000
    },
    --烹饪
    ['烤鸭'] = {
        colorTable = {
            {417, 287, 0xe8ebe5},
            {463, 277, 0xbcb3ba},
            {404, 279, 0xd8c598},
            {439, 264, 0xe6b135},
            {438, 281, 0x905c29},
            {429, 288, 0xeef2f0}
        },
        level = 0,
        itemType = '烹饪',
        topPrice = 30000
    },
    ['豆斋果'] = {
        colorTable = {
            {781, 609, 0xd0881b},
            {796, 602, 0xf0c4d8},
            {812, 600, 0xf0d6f0},
            {829, 616, 0x38283f},
            {809, 618, 0xf05100},
            {795, 627, 0xa88a70},
            {799, 647, 0x8d7770}
        },
        level = 0,
        itemType = '烹饪',
        topPrice = 30000
    },
    ['翡翠豆腐'] = {
        colorTable = {
            {788, 266, 0x43d153},
            {805, 266, 0x3ad64f},
            {783, 280, 0x078d07},
            {797, 287, 0xf0f6ef},
            {827, 279, 0x9b9594}
        },
        level = 0,
        itemType = '烹饪',
        topPrice = 30000
    },
    ['梅花酒'] = {
        colorTable = {
            {968, 270, 0x3e3923},
            {985, 270, 0xb06056},
            {1004, 272, 0xb6889a},
            {973, 283, 0x978352},
            {983, 287, 0x99833e},
            {993, 294, 0x7b6b37}
        },
        level = 0,
        itemType = '烹饪',
        topPrice = 30000
    },
    ['蛇胆酒'] = {
        colorTable = {
            {791, 439, 0x4a4d46},
            {807, 439, 0x363521},
            {820, 445, 0xe4d492},
            {800, 456, 0xd2c943},
            {811, 458, 0x36352b}
        },
        level = 0,
        itemType = '烹饪',
        topPrice = 30000
    },
    ['醉生梦死'] = {
        colorTable = {
            {969, 442, 0xe0c4a1},
            {989, 438, 0x7c5e55},
            {1008, 445, 0x584044},
            {979, 458, 0x74141d},
            {996, 460, 0x322230}
        },
        level = 0,
        itemType = '烹饪',
        topPrice = 30000
    },
    ['佛跳墙'] = {
        colorTable = {
            {1336, 264, 0x266919},
            {1360, 287, 0x302f2f},
            {1351, 298, 0x5d5757},
            {1367, 285, 0x302e2b},
            {1337, 275, 0xd8d8d0}
        },
        level = 0,
        itemType = '烹饪',
        topPrice = 30000
    },
    ['珍露酒'] = {
        colorTable = {
            {419, 262, 0x5e5647},
            {425, 272, 0x68593a},
            {443, 271, 0x49341a},
            {443, 260, 0x403c43},
            {427, 290, 0x8a7a5a},
            {437, 290, 0x615430}
        },
        level = 0,
        itemType = '烹饪',
        topPrice = 30000
    },
    ['臭豆腐'] = {
        colorTable = {
            {1160, 263, 0xba8845},
            {1180, 264, 0xa27040},
            {1147, 276, 0xb78348},
            {1197, 274, 0x725040},
            {1163, 285, 0xe9f0e7},
            {1139, 270, 0xf0f8f0}
        },
        level = 0,
        itemType = '烹饪',
        topPrice = 30000
    },
    ['桂花丸'] = {
        colorTable = {
            {1149, 443, 0x6d7c7d},
            {1163, 438, 0xe4eeac},
            {1171, 441, 0xc5d485},
            {1186, 446, 0x2f5c21},
            {1178, 457, 0x2f6c23}
        },
        level = 0,
        itemType = '烹饪',
        topPrice = 30000
    },
    ['长寿面'] = {
        colorTable = {
            {631, 600, 0x786845},
            {611, 614, 0xccc8ad},
            {613, 633, 0x78ecf0},
            {632, 631, 0x018f9b},
            {632, 621, 0xf0f6dd}
        },
        level = 0,
        itemType = '烹饪',
        topPrice = 30000
    },
    ['百味酒'] = {
        colorTable = {
            {607, 441, 0x2e2c16},
            {620, 441, 0x100d00},
            {629, 435, 0x3e3e4b},
            {608, 457, 0x7b7037},
            {616, 456, 0xb69f4c}
        },
        level = 0,
        itemType = '烹饪',
        topPrice = 30000
    },
    ['烤肉'] = {
        colorTable = {
            {589, 276, 0xf09418},
            {597, 263, 0xc09e6b},
            {613, 283, 0xa83246},
            {645, 280, 0xcab7c2},
            {635, 280, 0x7f767f}
        },
        level = 0,
        itemType = '烹饪',
        topPrice = 30000
    }
}

return item